{"modelTopology": {"keras_version": "2.2.2", "backend": "theano", "model_config": {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 55709, "output_dim": 300, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_1", "trainable": true, "layer": {"class_name": "LSTM", "config": {"name": "lstm_1", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 218, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}}, "merge_mode": "concat"}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "units": 35, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "training_config": {"optimizer_config": {"class_name": "Adam", "config": {"lr": 0.0010000000474974513, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "decay": 0.0, "epsilon": 1e-07, "amsgrad": false}}, "loss": "categorical_crossentropy", "metrics": ["categorical_accuracy"], "sample_weight_mode": null, "loss_weights": null}}, "weightsManifest": [{"paths": ["group1-shard1of17", "group1-shard2of17", "group1-shard3of17", "group1-shard4of17", "group1-shard5of17", "group1-shard6of17", "group1-shard7of17", "group1-shard8of17", "group1-shard9of17", "group1-shard10of17", "group1-shard11of17", "group1-shard12of17", "group1-shard13of17", "group1-shard14of17", "group1-shard15of17", "group1-shard16of17", "group1-shard17of17"], "weights": [{"name": "bidirectional_1/forward_lstm_1/kernel", "shape": [300, 872], "dtype": "float32"}, {"name": "bidirectional_1/forward_lstm_1/recurrent_kernel", "shape": [218, 872], "dtype": "float32"}, {"name": "bidirectional_1/forward_lstm_1/bias", "shape": [872], "dtype": "float32"}, {"name": "bidirectional_1/backward_lstm_1/kernel", "shape": [300, 872], "dtype": "float32"}, {"name": "bidirectional_1/backward_lstm_1/recurrent_kernel", "shape": [218, 872], "dtype": "float32"}, {"name": "bidirectional_1/backward_lstm_1/bias", "shape": [872], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [436, 35], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [35], "dtype": "float32"}, {"name": "embedding_1/embeddings", "shape": [55709, 300], "dtype": "float32"}]}]}