{"modelTopology": {"keras_version": "2.2.2", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_6", "layers": [{"name": "input_6", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 200], "dtype": "int32", "sparse": false, "name": "input_6"}, "inbound_nodes": []}, {"name": "embedding_7", "class_name": "Embedding", "config": {"name": "embedding_7", "trainable": true, "batch_input_shape": [null, 200], "dtype": "float32", "input_dim": 50002, "output_dim": 300, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 200}, "inbound_nodes": [[["input_6", 0, 0, {}]]]}, {"name": "conv1d_31", "class_name": "Conv1D", "config": {"name": "conv1d_31", "trainable": true, "filters": 32, "kernel_size": [2], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["embedding_7", 0, 0, {}]]]}, {"name": "conv1d_32", "class_name": "Conv1D", "config": {"name": "conv1d_32", "trainable": true, "filters": 32, "kernel_size": [4], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["embedding_7", 0, 0, {}]]]}, {"name": "conv1d_33", "class_name": "Conv1D", "config": {"name": "conv1d_33", "trainable": true, "filters": 32, "kernel_size": [8], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["embedding_7", 0, 0, {}]]]}, {"name": "conv1d_34", "class_name": "Conv1D", "config": {"name": "conv1d_34", "trainable": true, "filters": 32, "kernel_size": [2], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_31", 0, 0, {}]]]}, {"name": "conv1d_35", "class_name": "Conv1D", "config": {"name": "conv1d_35", "trainable": true, "filters": 32, "kernel_size": [4], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_32", 0, 0, {}]]]}, {"name": "conv1d_36", "class_name": "Conv1D", "config": {"name": "conv1d_36", "trainable": true, "filters": 32, "kernel_size": [8], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_33", 0, 0, {}]]]}, {"name": "max_pooling1d_10", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_10", "trainable": true, "strides": [2], "pool_size": [2], "padding": "valid"}, "inbound_nodes": [[["conv1d_34", 0, 0, {}]]]}, {"name": "max_pooling1d_11", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_11", "trainable": true, "strides": [2], "pool_size": [2], "padding": "valid"}, "inbound_nodes": [[["conv1d_35", 0, 0, {}]]]}, {"name": "max_pooling1d_12", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_12", "trainable": true, "strides": [2], "pool_size": [2], "padding": "valid"}, "inbound_nodes": [[["conv1d_36", 0, 0, {}]]]}, {"name": "concatenate_6", "class_name": "Concatenate", "config": {"name": "concatenate_6", "trainable": true, "axis": 1}, "inbound_nodes": [[["max_pooling1d_10", 0, 0, {}], ["max_pooling1d_11", 0, 0, {}], ["max_pooling1d_12", 0, 0, {}]]]}, {"name": "flatten_6", "class_name": "Flatten", "config": {"name": "flatten_6", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["concatenate_6", 0, 0, {}]]]}, {"name": "dropout_10", "class_name": "Dropout", "config": {"name": "dropout_10", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["flatten_6", 0, 0, {}]]]}, {"name": "dense_12", "class_name": "Dense", "config": {"name": "dense_12", "trainable": true, "units": 256, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_10", 0, 0, {}]]]}, {"name": "dropout_11", "class_name": "Dropout", "config": {"name": "dropout_11", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["dense_12", 0, 0, {}]]]}, {"name": "dense_13", "class_name": "Dense", "config": {"name": "dense_13", "trainable": true, "units": 38, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_11", 0, 0, {}]]]}], "input_layers": [["input_6", 0, 0]], "output_layers": [["dense_13", 0, 0]]}}, "training_config": {"optimizer_config": {"class_name": "Adam", "config": {"lr": 0.0010000000474974513, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "decay": 0.0, "epsilon": 1e-07, "amsgrad": false}}, "loss": "binary_crossentropy", "metrics": ["top_k_categorical_accuracy"], "sample_weight_mode": null, "loss_weights": null}}, "weightsManifest": [{"paths": ["group1-shard1of17", "group1-shard2of17", "group1-shard3of17", "group1-shard4of17", "group1-shard5of17", "group1-shard6of17", "group1-shard7of17", "group1-shard8of17", "group1-shard9of17", "group1-shard10of17", "group1-shard11of17", "group1-shard12of17", "group1-shard13of17", "group1-shard14of17", "group1-shard15of17", "group1-shard16of17", "group1-shard17of17"], "weights": [{"name": "conv1d_31/kernel", "shape": [2, 300, 32], "dtype": "float32"}, {"name": "conv1d_31/bias", "shape": [32], "dtype": "float32"}, {"name": "conv1d_32/kernel", "shape": [4, 300, 32], "dtype": "float32"}, {"name": "conv1d_32/bias", "shape": [32], "dtype": "float32"}, {"name": "conv1d_33/kernel", "shape": [8, 300, 32], "dtype": "float32"}, {"name": "conv1d_33/bias", "shape": [32], "dtype": "float32"}, {"name": "conv1d_34/kernel", "shape": [2, 32, 32], "dtype": "float32"}, {"name": "conv1d_34/bias", "shape": [32], "dtype": "float32"}, {"name": "conv1d_35/kernel", "shape": [4, 32, 32], "dtype": "float32"}, {"name": "conv1d_35/bias", "shape": [32], "dtype": "float32"}, {"name": "conv1d_36/kernel", "shape": [8, 32, 32], "dtype": "float32"}, {"name": "conv1d_36/bias", "shape": [32], "dtype": "float32"}, {"name": "dense_12/kernel", "shape": [9248, 256], "dtype": "float32"}, {"name": "dense_12/bias", "shape": [256], "dtype": "float32"}, {"name": "dense_13/kernel", "shape": [256, 38], "dtype": "float32"}, {"name": "dense_13/bias", "shape": [38], "dtype": "float32"}, {"name": "embedding_7/embeddings", "shape": [50002, 300], "dtype": "float32"}]}]}