{"weightsManifest": [{"weights": [{"dtype": "float32", "name": "bidirectional_1/forward_lstm_1/kernel", "shape": [5, 1024]}, {"dtype": "float32", "name": "bidirectional_1/forward_lstm_1/recurrent_kernel", "shape": [256, 1024]}, {"dtype": "float32", "name": "bidirectional_1/forward_lstm_1/bias", "shape": [1024]}, {"dtype": "float32", "name": "bidirectional_1/backward_lstm_1/kernel", "shape": [5, 1024]}, {"dtype": "float32", "name": "bidirectional_1/backward_lstm_1/recurrent_kernel", "shape": [256, 1024]}, {"dtype": "float32", "name": "bidirectional_1/backward_lstm_1/bias", "shape": [1024]}, {"dtype": "float32", "name": "bidirectional_2/forward_lstm_2/kernel", "shape": [512, 1024]}, {"dtype": "float32", "name": "bidirectional_2/forward_lstm_2/recurrent_kernel", "shape": [256, 1024]}, {"dtype": "float32", "name": "bidirectional_2/forward_lstm_2/bias", "shape": [1024]}, {"dtype": "float32", "name": "bidirectional_2/backward_lstm_2/kernel", "shape": [512, 1024]}, {"dtype": "float32", "name": "bidirectional_2/backward_lstm_2/recurrent_kernel", "shape": [256, 1024]}, {"dtype": "float32", "name": "bidirectional_2/backward_lstm_2/bias", "shape": [1024]}, {"dtype": "float32", "name": "bidirectional_3/forward_lstm_3/kernel", "shape": [512, 512]}, {"dtype": "float32", "name": "bidirectional_3/forward_lstm_3/recurrent_kernel", "shape": [128, 512]}, {"dtype": "float32", "name": "bidirectional_3/forward_lstm_3/bias", "shape": [512]}, {"dtype": "float32", "name": "bidirectional_3/backward_lstm_3/kernel", "shape": [512, 512]}, {"dtype": "float32", "name": "bidirectional_3/backward_lstm_3/recurrent_kernel", "shape": [128, 512]}, {"dtype": "float32", "name": "bidirectional_3/backward_lstm_3/bias", "shape": [512]}, {"dtype": "float32", "name": "embedding_1/embeddings", "shape": [76, 5]}, {"dtype": "float32", "name": "time_distributed_1/kernel", "shape": [256, 36]}, {"dtype": "float32", "name": "time_distributed_1/bias", "shape": [36]}], "paths": ["group1-shard1of3", "group1-shard2of3", "group1-shard3of3"]}], "modelTopology": {"keras_version": "2.0.8", "model_config": {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"trainable": true, "batch_input_shape": [null, 60], "input_dim": 76, "name": "embedding_1", "output_dim": 5, "embeddings_regularizer": null, "dtype": "float32", "input_length": 60, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "minval": -0.05, "maxval": 0.05}}, "embeddings_constraint": null, "mask_zero": false, "activity_regularizer": null}}, {"class_name": "Bidirectional", "config": {"trainable": true, "layer": {"class_name": "LSTM", "config": {"bias_regularizer": null, "stateful": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "return_state": false, "bias_constraint": null, "implementation": 0, "go_backwards": false, "activation": "tanh", "dropout": 0.1, "name": "lstm_1", "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "recurrent_dropout": 0.1, "recurrent_constraint": null, "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "return_sequences": true, "kernel_regularizer": null, "recurrent_regularizer": null, "unroll": true, "units": 256}}, "name": "bidirectional_1", "merge_mode": "concat"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.1, "name": "dropout_1"}}, {"class_name": "Bidirectional", "config": {"trainable": true, "layer": {"class_name": "LSTM", "config": {"bias_regularizer": null, "stateful": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "return_state": false, "bias_constraint": null, "implementation": 0, "go_backwards": false, "activation": "tanh", "dropout": 0.1, "name": "lstm_2", "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "recurrent_dropout": 0.1, "recurrent_constraint": null, "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "return_sequences": true, "kernel_regularizer": null, "recurrent_regularizer": null, "unroll": true, "units": 256}}, "name": "bidirectional_2", "merge_mode": "concat"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.1, "name": "dropout_2"}}, {"class_name": "Bidirectional", "config": {"trainable": true, "layer": {"class_name": "LSTM", "config": {"bias_regularizer": null, "stateful": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "return_state": false, "bias_constraint": null, "implementation": 0, "go_backwards": false, "activation": "tanh", "dropout": 0.25, "name": "lstm_3", "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "recurrent_dropout": 0.25, "recurrent_constraint": null, "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "return_sequences": true, "kernel_regularizer": null, "recurrent_regularizer": null, "unroll": true, "units": 128}}, "name": "bidirectional_3", "merge_mode": "concat"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.25, "name": "dropout_3"}}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "Dense", "config": {"trainable": true, "units": 36, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "activation": "softmax", "bias_constraint": null, "name": "dense_1", "activity_regularizer": null, "kernel_constraint": null, "use_bias": true}}, "dtype": "float32", "name": "time_distributed_1", "batch_input_shape": [null, 60, 128]}}]}, "training_config": {"metrics": ["categorical_accuracy"], "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-08, "lr": 0.0010000000474974513}}, "sample_weight_mode": null, "loss": "categorical_crossentropy"}, "backend": "tensorflow"}}