{"weightsManifest": [{"paths": ["group1-shard1of99", "group1-shard2of99", "group1-shard3of99", "group1-shard4of99", "group1-shard5of99", "group1-shard6of99", "group1-shard7of99", "group1-shard8of99", "group1-shard9of99", "group1-shard10of99", "group1-shard11of99", "group1-shard12of99", "group1-shard13of99", "group1-shard14of99", "group1-shard15of99", "group1-shard16of99", "group1-shard17of99", "group1-shard18of99", "group1-shard19of99", "group1-shard20of99", "group1-shard21of99", "group1-shard22of99", "group1-shard23of99", "group1-shard24of99", "group1-shard25of99", "group1-shard26of99", "group1-shard27of99", "group1-shard28of99", "group1-shard29of99", "group1-shard30of99", "group1-shard31of99", "group1-shard32of99", "group1-shard33of99", "group1-shard34of99", "group1-shard35of99", "group1-shard36of99", "group1-shard37of99", "group1-shard38of99", "group1-shard39of99", "group1-shard40of99", "group1-shard41of99", "group1-shard42of99", "group1-shard43of99", "group1-shard44of99", "group1-shard45of99", "group1-shard46of99", "group1-shard47of99", "group1-shard48of99", "group1-shard49of99", "group1-shard50of99", "group1-shard51of99", "group1-shard52of99", "group1-shard53of99", "group1-shard54of99", "group1-shard55of99", "group1-shard56of99", "group1-shard57of99", "group1-shard58of99", "group1-shard59of99", "group1-shard60of99", "group1-shard61of99", "group1-shard62of99", "group1-shard63of99", "group1-shard64of99", "group1-shard65of99", "group1-shard66of99", "group1-shard67of99", "group1-shard68of99", "group1-shard69of99", "group1-shard70of99", "group1-shard71of99", "group1-shard72of99", "group1-shard73of99", "group1-shard74of99", "group1-shard75of99", "group1-shard76of99", "group1-shard77of99", "group1-shard78of99", "group1-shard79of99", "group1-shard80of99", "group1-shard81of99", "group1-shard82of99", "group1-shard83of99", "group1-shard84of99", "group1-shard85of99", "group1-shard86of99", "group1-shard87of99", "group1-shard88of99", "group1-shard89of99", "group1-shard90of99", "group1-shard91of99", "group1-shard92of99", "group1-shard93of99", "group1-shard94of99", "group1-shard95of99", "group1-shard96of99", "group1-shard97of99", "group1-shard98of99", "group1-shard99of99"], "weights": [{"name": "batch_normalization_1_1/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_1_1/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_1_1/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_1_1/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "conv1d_1_1/kernel", "shape": [2, 300, 32], "dtype": "float32"}, {"name": "conv1d_1_1/bias", "shape": [32], "dtype": "float32"}, {"name": "conv1d_2_1/kernel", "shape": [4, 300, 32], "dtype": "float32"}, {"name": "conv1d_2_1/bias", "shape": [32], "dtype": "float32"}, {"name": "conv1d_3_1/kernel", "shape": [8, 300, 32], "dtype": "float32"}, {"name": "conv1d_3_1/bias", "shape": [32], "dtype": "float32"}, {"name": "conv1d_4_1/kernel", "shape": [2, 32, 32], "dtype": "float32"}, {"name": "conv1d_4_1/bias", "shape": [32], "dtype": "float32"}, {"name": "conv1d_5_1/kernel", "shape": [4, 32, 32], "dtype": "float32"}, {"name": "conv1d_5_1/bias", "shape": [32], "dtype": "float32"}, {"name": "conv1d_6_1/kernel", "shape": [8, 32, 32], "dtype": "float32"}, {"name": "conv1d_6_1/bias", "shape": [32], "dtype": "float32"}, {"name": "dense_2_1/kernel", "shape": [192, 64], "dtype": "float32"}, {"name": "dense_2_1/bias", "shape": [64], "dtype": "float32"}, {"name": "dense_3/kernel", "shape": [64, 38], "dtype": "float32"}, {"name": "dense_3/bias", "shape": [38], "dtype": "float32"}, {"name": "embedding_2/embeddings", "shape": [343308, 300], "dtype": "float32"}]}], "modelTopology": {"backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_1", "output_layers": [["dense_3", 0, 0]], "input_layers": [["input_1", 0, 0]], "layers": [{"name": "input_1", "class_name": "InputLayer", "inbound_nodes": [], "config": {"name": "input_1", "batch_input_shape": [null, 200], "dtype": "int32", "sparse": false}}, {"name": "embedding_2", "class_name": "Embedding", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"trainable": true, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "minval": -0.05, "maxval": 0.05}}, "input_dim": 343308, "name": "embedding_2", "embeddings_regularizer": null, "mask_zero": false, "embeddings_constraint": null, "batch_input_shape": [null, 200], "dtype": "float32", "input_length": 200, "output_dim": 300, "activity_regularizer": null}}, {"name": "conv1d_1", "class_name": "Conv1D", "inbound_nodes": [[["embedding_2", 0, 0, {}]]], "config": {"padding": "valid", "data_format": "channels_last", "kernel_constraint": null, "activation": "relu", "bias_constraint": null, "kernel_size": [2], "name": "conv1d_1", "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "stddev": 0.05, "mean": 0.0}}, "bias_regularizer": null, "filters": 32, "use_bias": true, "strides": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1], "activity_regularizer": null}}, {"name": "conv1d_2", "class_name": "Conv1D", "inbound_nodes": [[["embedding_2", 0, 0, {}]]], "config": {"padding": "valid", "data_format": "channels_last", "kernel_constraint": null, "activation": "relu", "bias_constraint": null, "kernel_size": [4], "name": "conv1d_2", "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "stddev": 0.05, "mean": 0.0}}, "bias_regularizer": null, "filters": 32, "use_bias": true, "strides": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1], "activity_regularizer": null}}, {"name": "conv1d_3", "class_name": "Conv1D", "inbound_nodes": [[["embedding_2", 0, 0, {}]]], "config": {"padding": "valid", "data_format": "channels_last", "kernel_constraint": null, "activation": "relu", "bias_constraint": null, "kernel_size": [8], "name": "conv1d_3", "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "stddev": 0.05, "mean": 0.0}}, "bias_regularizer": null, "filters": 32, "use_bias": true, "strides": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1], "activity_regularizer": null}}, {"name": "dynamic_k_max_pooling_1", "class_name": "DynamicKMaxPooling", "inbound_nodes": [[["conv1d_1", 0, 0, {}]]], "config": {"name": "dynamic_k_max_pooling_1", "trainable": true}}, {"name": "dynamic_k_max_pooling_2", "class_name": "DynamicKMaxPooling", "inbound_nodes": [[["conv1d_2", 0, 0, {}]]], "config": {"name": "dynamic_k_max_pooling_2", "trainable": true}}, {"name": "dynamic_k_max_pooling_3", "class_name": "DynamicKMaxPooling", "inbound_nodes": [[["conv1d_3", 0, 0, {}]]], "config": {"name": "dynamic_k_max_pooling_3", "trainable": true}}, {"name": "reshape_1", "class_name": "Reshape", "inbound_nodes": [[["dynamic_k_max_pooling_1", 0, 0, {}]]], "config": {"name": "reshape_1", "target_shape": [-1, 32], "trainable": true}}, {"name": "reshape_2", "class_name": "Reshape", "inbound_nodes": [[["dynamic_k_max_pooling_2", 0, 0, {}]]], "config": {"name": "reshape_2", "target_shape": [-1, 32], "trainable": true}}, {"name": "reshape_3", "class_name": "Reshape", "inbound_nodes": [[["dynamic_k_max_pooling_3", 0, 0, {}]]], "config": {"name": "reshape_3", "target_shape": [-1, 32], "trainable": true}}, {"name": "conv1d_4", "class_name": "Conv1D", "inbound_nodes": [[["reshape_1", 0, 0, {}]]], "config": {"padding": "valid", "data_format": "channels_last", "kernel_constraint": null, "activation": "relu", "bias_constraint": null, "kernel_size": [2], "name": "conv1d_4", "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "stddev": 0.05, "mean": 0.0}}, "bias_regularizer": null, "filters": 32, "use_bias": true, "strides": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1], "activity_regularizer": null}}, {"name": "conv1d_5", "class_name": "Conv1D", "inbound_nodes": [[["reshape_2", 0, 0, {}]]], "config": {"padding": "valid", "data_format": "channels_last", "kernel_constraint": null, "activation": "relu", "bias_constraint": null, "kernel_size": [4], "name": "conv1d_5", "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "stddev": 0.05, "mean": 0.0}}, "bias_regularizer": null, "filters": 32, "use_bias": true, "strides": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1], "activity_regularizer": null}}, {"name": "conv1d_6", "class_name": "Conv1D", "inbound_nodes": [[["reshape_3", 0, 0, {}]]], "config": {"padding": "valid", "data_format": "channels_last", "kernel_constraint": null, "activation": "relu", "bias_constraint": null, "kernel_size": [8], "name": "conv1d_6", "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "stddev": 0.05, "mean": 0.0}}, "bias_regularizer": null, "filters": 32, "use_bias": true, "strides": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1], "activity_regularizer": null}}, {"name": "k_max_pooling_1", "class_name": "KMaxPooling", "inbound_nodes": [[["conv1d_4", 0, 0, {}]]], "config": {"name": "k_max_pooling_1", "trainable": true}}, {"name": "k_max_pooling_2", "class_name": "KMaxPooling", "inbound_nodes": [[["conv1d_5", 0, 0, {}]]], "config": {"name": "k_max_pooling_2", "trainable": true}}, {"name": "k_max_pooling_3", "class_name": "KMaxPooling", "inbound_nodes": [[["conv1d_6", 0, 0, {}]]], "config": {"name": "k_max_pooling_3", "trainable": true}}, {"name": "concatenate_1", "class_name": "Concatenate", "inbound_nodes": [[["k_max_pooling_1", 0, 0, {}], ["k_max_pooling_2", 0, 0, {}], ["k_max_pooling_3", 0, 0, {}]]], "config": {"name": "concatenate_1", "trainable": true, "axis": 1}}, {"name": "dropout_4", "class_name": "Dropout", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "config": {"name": "dropout_4", "seed": null, "trainable": true, "noise_shape": null, "rate": 0.5}}, {"name": "flatten_1", "class_name": "Flatten", "inbound_nodes": [[["dropout_4", 0, 0, {}]]], "config": {"name": "flatten_1", "data_format": "channels_last", "trainable": true}}, {"name": "dense_2", "class_name": "Dense", "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "config": {"kernel_constraint": null, "units": 64, "activation": "relu", "bias_constraint": null, "name": "dense_2", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null}}, {"name": "batch_normalization_1", "class_name": "BatchNormalization", "inbound_nodes": [[["dense_2", 0, 0, {}]]], "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": -1, "momentum": 0.99, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "trainable": true, "name": "batch_normalization_1", "gamma_regularizer": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null}}, {"name": "dense_3", "class_name": "Dense", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "config": {"kernel_constraint": null, "units": 38, "activation": "sigmoid", "bias_constraint": null, "name": "dense_3", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null}}]}}, "keras_version": "2.2.2", "training_config": {"sample_weight_mode": null, "optimizer_config": {"class_name": "Adam", "config": {"epsilon": 1e-07, "decay": 0.0, "beta_2": 0.9990000128746033, "amsgrad": false, "lr": 0.0010000000474974513, "beta_1": 0.8999999761581421}}, "loss_weights": null, "loss": "binary_crossentropy", "metrics": ["top_k_categorical_accuracy"]}}}