{"weightsManifest": [{"paths": ["group1-shard1of89", "group1-shard2of89", "group1-shard3of89", "group1-shard4of89", "group1-shard5of89", "group1-shard6of89", "group1-shard7of89", "group1-shard8of89", "group1-shard9of89", "group1-shard10of89", "group1-shard11of89", "group1-shard12of89", "group1-shard13of89", "group1-shard14of89", "group1-shard15of89", "group1-shard16of89", "group1-shard17of89", "group1-shard18of89", "group1-shard19of89", "group1-shard20of89", "group1-shard21of89", "group1-shard22of89", "group1-shard23of89", "group1-shard24of89", "group1-shard25of89", "group1-shard26of89", "group1-shard27of89", "group1-shard28of89", "group1-shard29of89", "group1-shard30of89", "group1-shard31of89", "group1-shard32of89", "group1-shard33of89", "group1-shard34of89", "group1-shard35of89", "group1-shard36of89", "group1-shard37of89", "group1-shard38of89", "group1-shard39of89", "group1-shard40of89", "group1-shard41of89", "group1-shard42of89", "group1-shard43of89", "group1-shard44of89", "group1-shard45of89", "group1-shard46of89", "group1-shard47of89", "group1-shard48of89", "group1-shard49of89", "group1-shard50of89", "group1-shard51of89", "group1-shard52of89", "group1-shard53of89", "group1-shard54of89", "group1-shard55of89", "group1-shard56of89", "group1-shard57of89", "group1-shard58of89", "group1-shard59of89", "group1-shard60of89", "group1-shard61of89", "group1-shard62of89", "group1-shard63of89", "group1-shard64of89", "group1-shard65of89", "group1-shard66of89", "group1-shard67of89", "group1-shard68of89", "group1-shard69of89", "group1-shard70of89", "group1-shard71of89", "group1-shard72of89", "group1-shard73of89", "group1-shard74of89", "group1-shard75of89", "group1-shard76of89", "group1-shard77of89", "group1-shard78of89", "group1-shard79of89", "group1-shard80of89", "group1-shard81of89", "group1-shard82of89", "group1-shard83of89", "group1-shard84of89", "group1-shard85of89", "group1-shard86of89", "group1-shard87of89", "group1-shard88of89", "group1-shard89of89"], "weights": [{"dtype": "float32", "name": "conv1d_1/kernel", "shape": [3, 300, 2]}, {"dtype": "float32", "name": "conv1d_1/bias", "shape": [2]}, {"dtype": "float32", "name": "conv1d_2/kernel", "shape": [2, 300, 2]}, {"dtype": "float32", "name": "conv1d_2/bias", "shape": [2]}, {"dtype": "float32", "name": "dense_1/kernel", "shape": [3996, 50]}, {"dtype": "float32", "name": "dense_1/bias", "shape": [50]}, {"dtype": "float32", "name": "dense_2/kernel", "shape": [50, 2]}, {"dtype": "float32", "name": "dense_2/bias", "shape": [2]}, {"dtype": "float32", "name": "embedding/embeddings", "shape": [307915, 300]}]}], "modelTopology": {"keras_version": "2.2.2", "model_config": {"config": {"output_layers": [["dense_2", 0, 0]], "name": "model_1", "input_layers": [["input_1", 0, 0]], "layers": [{"config": {"dtype": "float32", "sparse": false, "name": "input_1", "batch_input_shape": [null, 2000]}, "inbound_nodes": [], "name": "input_1", "class_name": "InputLayer"}, {"config": {"mask_zero": false, "input_dim": 307915, "input_length": 2000, "dtype": "float32", "output_dim": 300, "embeddings_initializer": {"config": {"minval": -0.05, "seed": null, "maxval": 0.05}, "class_name": "RandomUniform"}, "batch_input_shape": [null, 2000], "embeddings_regularizer": null, "embeddings_constraint": null, "name": "embedding", "trainable": true, "activity_regularizer": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "embedding", "class_name": "Embedding"}, {"config": {"noise_shape": null, "seed": null, "trainable": true, "name": "dropout_3", "rate": 0.5}, "inbound_nodes": [[["embedding", 0, 0, {}]]], "name": "dropout_3", "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activity_regularizer": null, "name": "conv1d_1", "data_format": "channels_last", "padding": "valid", "use_bias": true, "kernel_size": [3], "dilation_rate": [1], "filters": 2, "strides": [1], "activation": "relu", "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "inbound_nodes": [[["dropout_3", 0, 0, {}]]], "name": "conv1d_1", "class_name": "Conv1D"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activity_regularizer": null, "name": "conv1d_2", "data_format": "channels_last", "padding": "valid", "use_bias": true, "kernel_size": [2], "dilation_rate": [1], "filters": 2, "strides": [1], "activation": "relu", "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "inbound_nodes": [[["dropout_3", 0, 0, {}]]], "name": "conv1d_2", "class_name": "Conv1D"}, {"config": {"strides": [2], "trainable": true, "name": "max_pooling1d_1", "pool_size": [2], "padding": "valid"}, "inbound_nodes": [[["conv1d_1", 0, 0, {}]]], "name": "max_pooling1d_1", "class_name": "MaxPooling1D"}, {"config": {"strides": [2], "trainable": true, "name": "max_pooling1d_2", "pool_size": [2], "padding": "valid"}, "inbound_nodes": [[["conv1d_2", 0, 0, {}]]], "name": "max_pooling1d_2", "class_name": "MaxPooling1D"}, {"config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_1", 0, 0, {}]]], "name": "flatten_1", "class_name": "Flatten"}, {"config": {"name": "flatten_2", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_2", 0, 0, {}]]], "name": "flatten_2", "class_name": "Flatten"}, {"config": {"name": "concatenate_1", "trainable": true, "axis": -1}, "inbound_nodes": [[["flatten_1", 0, 0, {}], ["flatten_2", 0, 0, {}]]], "name": "concatenate_1", "class_name": "Concatenate"}, {"config": {"noise_shape": null, "seed": null, "trainable": true, "name": "dropout_4", "rate": 0.5}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "name": "dropout_4", "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "units": 50, "name": "dense_1", "activation": "relu", "bias_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "inbound_nodes": [[["dropout_4", 0, 0, {}]]], "name": "dense_1", "class_name": "Dense"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "units": 2, "name": "dense_2", "activation": "softmax", "bias_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "inbound_nodes": [[["dense_1", 0, 0, {}]]], "name": "dense_2", "class_name": "Dense"}]}, "class_name": "Model"}, "backend": "tensorflow", "training_config": {"optimizer_config": {"config": {"decay": 0.0, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "lr": 0.0010000000474974513, "amsgrad": false, "beta_1": 0.8999999761581421}, "class_name": "Adam"}, "loss": "categorical_crossentropy", "metrics": ["accuracy"], "loss_weights": null, "sample_weight_mode": null}}}