{"modelTopology": {"keras_version": "2.2.2", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 60], "dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "embedding", "class_name": "Embedding", "config": {"name": "embedding", "trainable": true, "batch_input_shape": [null, 60], "dtype": "float32", "input_dim": 307915, "output_dim": 300, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 60}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "dropout_4", "class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["embedding", 0, 0, {}]]]}, {"name": "conv1d_1", "class_name": "Conv1D", "config": {"name": "conv1d_1", "trainable": true, "filters": 2, "kernel_size": [3], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_4", 0, 0, {}]]]}, {"name": "conv1d_2", "class_name": "Conv1D", "config": {"name": "conv1d_2", "trainable": true, "filters": 2, "kernel_size": [2], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_4", 0, 0, {}]]]}, {"name": "max_pooling1d_1", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_1", "trainable": true, "strides": [2], "pool_size": [2], "padding": "valid"}, "inbound_nodes": [[["conv1d_1", 0, 0, {}]]]}, {"name": "max_pooling1d_2", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_2", "trainable": true, "strides": [2], "pool_size": [2], "padding": "valid"}, "inbound_nodes": [[["conv1d_2", 0, 0, {}]]]}, {"name": "flatten_1", "class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_1", 0, 0, {}]]]}, {"name": "flatten_2", "class_name": "Flatten", "config": {"name": "flatten_2", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_2", 0, 0, {}]]]}, {"name": "concatenate_1", "class_name": "Concatenate", "config": {"name": "concatenate_1", "trainable": true, "axis": -1}, "inbound_nodes": [[["flatten_1", 0, 0, {}], ["flatten_2", 0, 0, {}]]]}, {"name": "dropout_5", "class_name": "Dropout", "config": {"name": "dropout_5", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"name": "dense_2", "class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_5", 0, 0, {}]]]}, {"name": "dense_3", "class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "units": 2, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_2", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_3", 0, 0]]}}, "training_config": {"optimizer_config": {"class_name": "Adam", "config": {"lr": 0.0010000000474974513, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "decay": 0.0, "epsilon": 1e-07, "amsgrad": false}}, "loss": "categorical_crossentropy", "metrics": ["accuracy"], "sample_weight_mode": null, "loss_weights": null}}, "weightsManifest": [{"paths": ["group1-shard1of89", "group1-shard2of89", "group1-shard3of89", "group1-shard4of89", "group1-shard5of89", "group1-shard6of89", "group1-shard7of89", "group1-shard8of89", "group1-shard9of89", "group1-shard10of89", "group1-shard11of89", "group1-shard12of89", "group1-shard13of89", "group1-shard14of89", "group1-shard15of89", "group1-shard16of89", "group1-shard17of89", "group1-shard18of89", "group1-shard19of89", "group1-shard20of89", "group1-shard21of89", "group1-shard22of89", "group1-shard23of89", "group1-shard24of89", "group1-shard25of89", "group1-shard26of89", "group1-shard27of89", "group1-shard28of89", "group1-shard29of89", "group1-shard30of89", "group1-shard31of89", "group1-shard32of89", "group1-shard33of89", "group1-shard34of89", "group1-shard35of89", "group1-shard36of89", "group1-shard37of89", "group1-shard38of89", "group1-shard39of89", "group1-shard40of89", "group1-shard41of89", "group1-shard42of89", "group1-shard43of89", "group1-shard44of89", "group1-shard45of89", "group1-shard46of89", "group1-shard47of89", "group1-shard48of89", "group1-shard49of89", "group1-shard50of89", "group1-shard51of89", "group1-shard52of89", "group1-shard53of89", "group1-shard54of89", "group1-shard55of89", "group1-shard56of89", "group1-shard57of89", "group1-shard58of89", "group1-shard59of89", "group1-shard60of89", "group1-shard61of89", "group1-shard62of89", "group1-shard63of89", "group1-shard64of89", "group1-shard65of89", "group1-shard66of89", "group1-shard67of89", "group1-shard68of89", "group1-shard69of89", "group1-shard70of89", "group1-shard71of89", "group1-shard72of89", "group1-shard73of89", "group1-shard74of89", "group1-shard75of89", "group1-shard76of89", "group1-shard77of89", "group1-shard78of89", "group1-shard79of89", "group1-shard80of89", "group1-shard81of89", "group1-shard82of89", "group1-shard83of89", "group1-shard84of89", "group1-shard85of89", "group1-shard86of89", "group1-shard87of89", "group1-shard88of89", "group1-shard89of89"], "weights": [{"name": "conv1d_1/kernel", "shape": [3, 300, 2], "dtype": "float32"}, {"name": "conv1d_1/bias", "shape": [2], "dtype": "float32"}, {"name": "conv1d_2/kernel", "shape": [2, 300, 2], "dtype": "float32"}, {"name": "conv1d_2/bias", "shape": [2], "dtype": "float32"}, {"name": "dense_2/kernel", "shape": [116, 50], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [50], "dtype": "float32"}, {"name": "dense_3/kernel", "shape": [50, 2], "dtype": "float32"}, {"name": "dense_3/bias", "shape": [2], "dtype": "float32"}, {"name": "embedding/embeddings", "shape": [307915, 300], "dtype": "float32"}]}]}