{"modelTopology": {"keras_version": "2.2.2", "backend": "theano", "model_config": {"class_name": "Model", "config": {"name": "model_3", "layers": [{"name": "input_3", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int32", "sparse": false, "name": "input_3"}, "inbound_nodes": []}, {"name": "input_4", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int32", "sparse": false, "name": "input_4"}, "inbound_nodes": []}, {"name": "embedding_2", "class_name": "Embedding", "config": {"name": "embedding_2", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 154994, "output_dim": 300, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_3", 0, 0, {}]], [["input_4", 0, 0, {}]]]}, {"name": "dot_1", "class_name": "Dot", "config": {"name": "dot_1", "trainable": true, "axes": 2, "normalize": true}, "inbound_nodes": [[["embedding_2", 0, 0, {}], ["embedding_2", 1, 0, {}]]]}], "input_layers": [["input_3", 0, 0], ["input_4", 0, 0]], "output_layers": [["dot_1", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of45", "group1-shard2of45", "group1-shard3of45", "group1-shard4of45", "group1-shard5of45", "group1-shard6of45", "group1-shard7of45", "group1-shard8of45", "group1-shard9of45", "group1-shard10of45", "group1-shard11of45", "group1-shard12of45", "group1-shard13of45", "group1-shard14of45", "group1-shard15of45", "group1-shard16of45", "group1-shard17of45", "group1-shard18of45", "group1-shard19of45", "group1-shard20of45", "group1-shard21of45", "group1-shard22of45", "group1-shard23of45", "group1-shard24of45", "group1-shard25of45", "group1-shard26of45", "group1-shard27of45", "group1-shard28of45", "group1-shard29of45", "group1-shard30of45", "group1-shard31of45", "group1-shard32of45", "group1-shard33of45", "group1-shard34of45", "group1-shard35of45", "group1-shard36of45", "group1-shard37of45", "group1-shard38of45", "group1-shard39of45", "group1-shard40of45", "group1-shard41of45", "group1-shard42of45", "group1-shard43of45", "group1-shard44of45", "group1-shard45of45"], "weights": [{"name": "embedding_2/embeddings", "shape": [154994, 300], "dtype": "float32"}]}]}