{"modelTopology": {"keras_version": "2.2.2", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_2", "layers": [{"name": "input_3", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int32", "sparse": false, "name": "input_3"}, "inbound_nodes": []}, {"name": "input_4", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int32", "sparse": false, "name": "input_4"}, "inbound_nodes": []}, {"name": "embedding_2", "class_name": "Embedding", "config": {"name": "embedding_2", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 50001, "output_dim": 300, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_3", 0, 0, {}]], [["input_4", 0, 0, {}]]]}, {"name": "dot_2", "class_name": "Dot", "config": {"name": "dot_2", "trainable": true, "axes": 2, "normalize": true}, "inbound_nodes": [[["embedding_2", 0, 0, {}], ["embedding_2", 1, 0, {}]]]}], "input_layers": [["input_3", 0, 0], ["input_4", 0, 0]], "output_layers": [["dot_2", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of15", "group1-shard2of15", "group1-shard3of15", "group1-shard4of15", "group1-shard5of15", "group1-shard6of15", "group1-shard7of15", "group1-shard8of15", "group1-shard9of15", "group1-shard10of15", "group1-shard11of15", "group1-shard12of15", "group1-shard13of15", "group1-shard14of15", "group1-shard15of15"], "weights": [{"name": "embedding_2/embeddings", "shape": [50001, 300], "dtype": "float32"}]}]}